[
  {
    "case_id": "case_3",
    "title": "Shoulder Dislocation",
    "demographics": {
      "age": "22",
      "gender": "male",
      "occupation": "university rugby player",
      "comorbidities": "none"
    },
    "presenting_complaint": "Left shoulder looks out of place and very painful after a rugby tackle about 30 minutes ago",
    "socrates": {
      "site": "Left shoulder",
      "onset": "Sudden, during tackle",
      "character": "Severe, throbbing",
      "radiation": "Upper arm",
      "associations": "Looks out of place, can’t move it",
      "timing": "Constant since injury",
      "exacerbating": "Any movement",
      "relieving": "Keeping arm still",
      "severity": "8/10"
    },
    "triage_info": {
      "injury_mechanism": "High-impact sports tackle",
      "red_flags": "Visible deformity, loss of function",
      "previous_treatment": "None",
      "functional_impact": "Cannot use arm"
    },
    "expected_triage": "Urgent Care/A&E",
    "clinical_notes": "High-energy trauma, deformity, and functional loss require urgent hospital care",
    "sample_conversation": [
      "I hurt my shoulder in rugby about half an hour ago.",
      "I was tackled and landed awkwardly.",
      "It looks wrong, like it’s popped forwards.",
      "No, I can’t move it — too painful.",
      "The pain goes a bit down my arm.",
      "No numbness or tingling.",
      "About 8 out of 10.",
      "Yes, any movement makes it worse.",
      "No, I’m just holding it still.",
      "No pain elsewhere.",
      "No pins and needles, just pain.",
      "No other health problems."
    ],
    "expanded_clinic_letter": "To GP,\n\nThis 22-year-old right-hand dominant university student, a keen rugby player, was admitted to A&E following a rugby tackle in which he landed directly on his left shoulder. He developed immediate pain, deformity, and inability to move the shoulder.\n\nHe lives in shared student accommodation and is otherwise fit and well. He is currently unable to continue sports and has difficulty dressing himself.\n\nOn arrival, inspection revealed loss of the normal shoulder contour with anterior prominence, consistent with dislocation. Movement was not possible due to pain. Distal pulses were intact, and he retained full finger and hand movement.\n\nRadiographs confirmed an anterior shoulder dislocation without associated fracture. Under procedural sedation, the shoulder was successfully reduced with immediate relief of pain. Post-reduction imaging confirmed concentric reduction. He was placed in a sling and given analgesia.\n\nHe has been discharged with advice to avoid driving and overhead activity, and referred to fracture clinic for review within 1 week. A physiotherapy referral has been made to support rehabilitation and reduce recurrence risk. He has been advised to avoid contact sport until cleared by orthopaedics.\n\nYours sincerely,\nA&E Registrar"
  },
  {
    "case_id": "case_4",
    "title": "Open Tibial Fracture",
    "demographics": {
      "age": "35",
      "gender": "male",
      "occupation": "cyclist",
      "comorbidities": "otherwise fit"
    },
    "presenting_complaint": "Severe right shin pain after a bike crash about an hour ago; there’s a cut and I can see bone",
    "socrates": {
      "site": "Right shin",
      "onset": "Sudden, following collision",
      "character": "Sharp, excruciating",
      "radiation": "Into foot",
      "associations": "Open wound with bone visible, bleeding",
      "timing": "Constant since accident",
      "exacerbating": "Any movement",
      "relieving": "Splinted by paramedics",
      "severity": "10/10"
    },
    "triage_info": {
      "injury_mechanism": "RTA at speed",
      "red_flags": "Open fracture, bleeding, severe pain",
      "previous_treatment": "Immobilisation by paramedics",
      "functional_impact": "Unable to bear weight"
    },
    "expected_triage": "Urgent Care/A&E",
    "clinical_notes": "Open fracture, severe trauma, surgical emergency",
    "sample_conversation": [
      "I crashed my bike — my shin’s split open and I can see the bone.",
      "It happened about an hour ago.",
      "Yes, paramedics put a dressing and a splint on it.",
      "Pain is 10 out of 10.",
      "It hurts into my foot as well.",
      "No numbness, just pain.",
      "I can’t stand on it at all.",
      "Just cuts and bruises elsewhere.",
      "I don’t take any regular medicines.",
      "I’m in the ambulance now."
    ],
    "expanded_clinic_letter": "To GP,\n\nThis 35-year-old man, a keen cyclist with no significant past medical history, was brought by ambulance following a road traffic accident. He sustained direct trauma to his right leg after being struck by a car whilst cycling.\n\nOn arrival to A&E he was haemodynamically stable but in severe distress. Examination revealed an open mid-shaft tibial fracture with gross deformity, bone protrusion, and active bleeding. There was swelling and bruising, but distal pulses were palpable and neurological function was preserved.\n\nImmediate management included IV access, analgesia, IV antibiotics, tetanus prophylaxis, haemorrhage control with sterile dressing, and splintage. Radiographs demonstrated a comminuted open fracture of the mid-shaft tibia.\n\nHe was taken urgently to theatre by the trauma and orthopaedic team for irrigation, debridement, and temporary external fixation. Definitive fixation will be undertaken once soft tissue condition allows. He remains admitted for ongoing care.\n\nSocially, he lives with his partner and works in IT. He will require significant time off work and input from rehabilitation services. He has been counselled on risk of infection, non-union, and long-term functional impact.\n\nYours sincerely,\nTrauma & Orthopaedics Registrar"
  },
  {
    "case_id": "case_5",
    "title": "Acute Foot Drop (Lumbar Disc Prolapse)",
    "demographics": {
      "age": "41",
      "gender": "female",
      "occupation": "warehouse worker",
      "comorbidities": "previous back pain"
    },
    "presenting_complaint": "Since yesterday my left foot keeps flopping — I can’t pull it up; back pain too",
    "socrates": {
      "site": "Low back with radiation to left leg",
      "onset": "Acute, noticed yesterday",
      "character": "Back pain with weakness rather than pain",
      "radiation": "Down to foot",
      "associations": "Can't lift foot (foot drop)",
      "timing": "Constant weakness since onset",
      "exacerbating": "Walking",
      "relieving": "Rest, but weakness remains",
      "severity": "Pain 6/10, weakness disabling"
    },
    "triage_info": {
      "injury_mechanism": "No trauma, acute disc prolapse suspected",
      "red_flags": "Neurological deficit (foot drop)",
      "previous_treatment": "Analgesia",
      "functional_impact": "Cannot work, walks with limp"
    },
    "expected_triage": "Urgent Care/A&E",
    "clinical_notes": "Sudden motor deficit = urgent surgical referral",
    "sample_conversation": [
      "All of a sudden I can’t lift my left foot.",
      "It started yesterday morning.",
      "I’ve had back pain before, but this new weakness is different.",
      "The pain shoots down my left leg into the foot.",
      "I’m dragging the foot when I walk.",
      "No problems with my bladder or bowels.",
      "No numbness between my legs.",
      "The pain is about 6 out of 10, but the weakness is the main issue.",
      "I’ve only taken ibuprofen.",
      "No other illnesses.",
      "Do I need to be seen today?",
      "Yes — I’ll go to A&E now."
    ],
    "expanded_clinic_letter": "To GP,\n\nThank you for referring this 41-year-old warehouse operative who presented with acute onset neurological deficit. She has a history of intermittent low back pain, but yesterday morning developed sudden weakness in the left foot, resulting in foot drop. She reported dragging the foot when walking and described paraesthesia along the outer leg and dorsum of the foot. She denied bladder or bowel disturbance.\n\nShe lives with her partner and two children. She is unable to carry out her work duties safely due to the foot weakness.\n\nExamination demonstrated marked weakness of ankle dorsiflexion (MRC 2/5) and extensor hallucis longus (1/5) on the left. Sensation was reduced in the L5 dermatome. Reflexes were preserved. Gait was antalgic with evident foot slap.\n\nUrgent MRI lumbar spine revealed a large left paracentral L4/5 disc prolapse compressing the left L5 nerve root. She was admitted to the spinal team and underwent urgent decompression surgery.\n\nShe has been counselled that neurological recovery may be incomplete and will require ongoing physiotherapy. Follow-up has been arranged in spinal clinic in 6 weeks. She has been provided with clear advice regarding safety-netting and functional aids as required.\n\nYours sincerely,\nOrthopaedic Registrar"
  },
  {
    "case_id": "case_1",
    "title": "Suspected Fracture (Wrist)",
    "demographics": {
      "age": "28",
      "gender": "male",
      "occupation": "delivery driver",
      "comorbidities": "smoker, otherwise well"
    },
    "presenting_complaint": "Really painful right wrist after a fall about an hour ago; looks bent",
    "socrates": {
      "site": "Right wrist",
      "onset": "Sudden, after fall on outstretched hand while carrying parcels",
      "character": "Sharp, severe",
      "radiation": "None",
      "associations": "Swelling, deformity, can't move fingers properly",
      "timing": "Constant since fall",
      "exacerbating": "Any attempt to move hand",
      "relieving": "None tried",
      "severity": "9/10"
    },
    "triage_info": {
      "injury_mechanism": "High-impact fall",
      "red_flags": "Gross deformity, inability to move fingers fully",
      "previous_treatment": "None",
      "functional_impact": "Unable to grip, can't work"
    },
    "expected_triage": "Urgent Care/A&E",
    "clinical_notes": "Acute trauma, deformity, severe pain, and neurovascular involvement → immediate A&E required",
    "sample_conversation": [
      "I fell earlier and my right wrist is agony.",
      "About an hour ago while I was delivering parcels.",
      "I tripped and landed on my hand.",
      "It’s a sharp, constant pain.",
      "It looks bent out of shape.",
      "I can barely move my fingers — it really hurts.",
      "There’s some tingling in my thumb.",
      "I’ve just kept it still.",
      "About 9 out of 10.",
      "I smoke but otherwise I’m healthy.",
      "No allergies that I know of.",
      "I can’t grip anything and I can’t work.",
      "My fingers look a bit pale."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for your referral of this 28-year-old gentleman, a delivery driver, who attended A&E following a fall onto his outstretched right hand earlier today. The injury occurred whilst he was carrying parcels during work. He presented with immediate and severe wrist pain rated 9/10, gross deformity, and swelling. He reported difficulty moving his fingers and noted altered sensation in the thumb with pallor of the digits.\n\n    He is otherwise fit and well, a smoker, and lives independently. He is right-hand dominant. His work involves frequent manual handling, and he is currently unable to perform any work duties.\n\n    On examination, there was an obvious deformity of the distal forearm with marked tenderness and swelling. Active wrist movement was not possible due to pain. Sensation was reduced in the radial distribution, and the fingers appeared pale though capillary refill was <2 seconds.\n\n    Plain radiographs demonstrated a displaced distal radius fracture with dorsal angulation. Given evidence of neurovascular compromise, he underwent urgent closed reduction under sedation in the emergency department, followed by application of a plaster backslab. Post-reduction assessment confirmed improved neurovascular status.\n\n    He has been discharged with oral analgesia, strict plaster care instructions, and safety-netting advice regarding worsening pain, numbness, or circulatory changes. He will be followed up in the fracture clinic within one week for consideration of definitive fixation. He has been advised to refrain from driving and manual work until further review.\n\n    Yours sincerely,\n    A&E Registrar"
  },
  {
    "case_id": "case_2",
    "title": "Acute Cauda Equina Syndrome",
    "demographics": {
      "age": "49",
      "gender": "female",
      "occupation": "office worker",
      "comorbidities": "history of sciatica"
    },
    "presenting_complaint": "Sudden severe back pain with new bladder leakage and numbness between the legs",
    "socrates": {
      "site": "Low back, radiating to both legs",
      "onset": "Sudden worsening over 24 hrs",
      "character": "Severe, crushing pain",
      "radiation": "Both legs, worse left",
      "associations": "Numbness in groin, bladder leakage",
      "timing": "Constant, deteriorating rapidly",
      "exacerbating": "Standing and walking",
      "relieving": "None",
      "severity": "10/10"
    },
    "triage_info": {
      "injury_mechanism": "Gradual back pain, sudden acute deterioration",
      "red_flags": "Saddle anaesthesia, bladder incontinence",
      "previous_treatment": "Analgesia only",
      "functional_impact": "Cannot walk far, incontinent"
    },
    "expected_triage": "Urgent Care/A&E",
    "clinical_notes": "Saddle anaesthesia + bladder dysfunction = surgical emergency",
    "sample_conversation": [
      "My back pain’s suddenly much worse and I can’t control my bladder.",
      "I’ve had back pain on and off for years, but this started in the last day.",
      "I feel numb between my legs and down my left leg.",
      "I can’t tell when I need the toilet — I leaked this morning.",
      "My legs feel heavy and it’s hard to walk.",
      "No fever.",
      "No recent injuries.",
      "Pain is 10 out of 10.",
      "I’ve taken painkillers but they’re not helping.",
      "No previous surgery.",
      "Should I go to hospital now?",
      "Yes — I’ll get someone to take me straight away."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 49-year-old office worker presented to A&E with acute onset neurological symptoms on a background of intermittent sciatica. She reported worsening bilateral low back pain over 24 hours, associated with perineal numbness and loss of bladder control. She rated the pain as 10/10 and described her legs as heavy and weak, making mobilising difficult.\n\n    She lives with her husband, works full-time at a desk, and has no previous spinal surgery.\n\n    On examination, she had bilateral neurological deficit affecting L5 and S1 myotomes, with weakness in ankle dorsiflexion and plantarflexion. Saddle anaesthesia and reduced anal tone were demonstrated. Reflexes were diminished but plantar responses were flexor.\n\n    An urgent MRI scan revealed a large central L4/5 disc prolapse compressing the cauda equina. She was admitted under the neurosurgical team and underwent emergency decompression the same evening.\n\n    She is currently recovering post-operatively and will require inpatient rehabilitation. Prognosis has been explained as variable, depending on neurological recovery. She has been counselled extensively on recognising red flag features in the future and safety-netting provided.\n\n    Yours sincerely,\n    Neurosurgical Registrar"
      },
  {
    "case_id": "case_6",
    "title": "Suspected Inflammatory Back Pain",
    "demographics": {
      "age": "32",
      "gender": "male",
      "occupation": "IT consultant",
      "comorbidities": "no significant PMH"
    },
    "presenting_complaint": "Low back pain for about 6 months — very stiff in the mornings, eases once I’m moving",
    "socrates": {
      "site": "Lumbar spine",
      "onset": "Gradual over 6 months",
      "character": "Stiff, aching",
      "radiation": "Occasionally to buttocks",
      "associations": "Morning stiffness >1 hr, improves with activity, night waking",
      "timing": "Worse at night and early morning",
      "exacerbating": "Rest, prolonged sitting",
      "relieving": "Movement, NSAIDs",
      "severity": "6/10"
    },
    "triage_info": {
      "injury_mechanism": "Insidious, not mechanical",
      "red_flags": "Night pain, prolonged morning stiffness",
      "previous_treatment": "Self-managed with over-the-counter ibuprofen",
      "functional_impact": "Struggles with sitting at desk, disturbed sleep"
    },
    "expected_triage": "GP/Primary Care",
    "clinical_notes": "Non-mechanical pattern + family history = GP review needed for rheumatology work-up",
    "sample_conversation": [
      "It’s been going on for about six months.",
      "There wasn’t an injury — it just came on gradually.",
      "It’s worse at night and first thing in the morning.",
      "I’m stiff for over an hour after waking.",
      "It eases once I’m up and moving.",
      "Ibuprofen helps a bit.",
      "No leg weakness or pins and needles.",
      "My dad has ankylosing spondylitis.",
      "Long meetings are tough — sitting makes it worse.",
      "No fevers or weight loss.",
      "Should I see my GP?",
      "Yes, I’ll book in."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for asking me to review this 32-year-old IT consultant who has reported a six-month history of persistent low back pain. The pain developed gradually without any clear injury. He describes it as an aching discomfort that is worse at night and on waking in the morning, when he is particularly stiff for over an hour. Symptoms improve with activity and exercise, but worsen with prolonged rest or sitting. He has noticed partial relief with ibuprofen.\n\n    There are no red flag systemic symptoms such as fever, weight loss, or neurological disturbance. Importantly, his father has ankylosing spondylitis. He is otherwise well, lives with his partner, and continues to work full time, although he finds long meetings and prolonged desk-based work increasingly difficult, which is beginning to impact his professional performance. He also reports disruption to sleep, leaving him fatigued during the day.\n\n    The clinical history is strongly suggestive of inflammatory back pain. At this stage, examination has not been performed, but further investigation is clearly warranted. I would recommend GP review with baseline blood tests including ESR, CRP, and FBC. Testing for HLA-B27 may also be appropriate depending on local pathways. Early referral to rheumatology should be considered for definitive assessment and pelvic imaging. He should continue with regular physical activity, and use NSAIDs as tolerated. He has been counselled regarding red flag symptoms and advised to seek urgent review should neurological features develop.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_7",
    "title": "Possible Spinal Malignancy",
    "demographics": {
      "age": "67",
      "gender": "female",
      "occupation": "retired teacher",
      "comorbidities": "PMH: breast cancer 5 years ago"
    },
    "presenting_complaint": "Mid-back pain for about 3 months, getting worse, and I’ve lost weight",
    "socrates": {
      "site": "Thoracic spine",
      "onset": "Gradual over 3 months",
      "character": "Deep, constant ache",
      "radiation": "None",
      "associations": "Weight loss (4 kg in 3 months), night pain",
      "timing": "Worse at night, not relieved by rest",
      "exacerbating": "Lying down",
      "relieving": "None",
      "severity": "7/10"
    },
    "triage_info": {
      "injury_mechanism": "Insidious",
      "red_flags": "Past cancer, weight loss, night pain",
      "previous_treatment": "Simple analgesia",
      "functional_impact": "Sleep disturbed, reduced mobility"
    },
    "expected_triage": "GP/Primary Care",
    "clinical_notes": "Past cancer + weight loss + night pain = urgent GP work-up",
    "sample_conversation": [
      "I’ve had mid-back pain that won’t settle.",
      "It’s been around three months and getting worse.",
      "It’s a deep, constant ache.",
      "It’s worse at night and lying down makes it worse.",
      "I’ve lost about four kilos without trying.",
      "I had breast cancer five years ago.",
      "No weakness, numbness or bladder problems.",
      "No recent injuries.",
      "Nothing I’ve tried helps.",
      "Do I need to see my GP urgently?",
      "Yes, I’ll call tomorrow."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 67-year-old retired teacher, with a history of breast carcinoma treated five years ago, presents with a three-month history of progressive mid-thoracic back pain. She describes a constant deep ache, worse at night and unrelieved by rest. Over the same period she has lost four kilograms unintentionally. She has not experienced limb weakness, numbness, or bladder or bowel dysfunction, and denies recent trauma.\n\n    She lives with her husband and is usually independent, enjoying gardening and walking, both of which she is now unable to manage because of the pain. She is increasingly reliant on her husband for help with daily tasks.\n\n    The combination of previous malignancy, progressive night pain, and unintentional weight loss is highly concerning for metastatic disease. Examination has not yet been undertaken, but urgent investigation is required. I would recommend GP assessment with baseline bloods including FBC, calcium, ESR and CRP, and liver function. An urgent spinal MRI should be arranged. Referral to oncology and spinal services may be required depending on the results. She should be counselled to attend immediately should she develop new neurological symptoms such as weakness, numbness, or bladder involvement.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_8",
    "title": "Knee Pain with Unclear Diagnosis",
    "demographics": {
      "age": "42",
      "gender": "male",
      "occupation": "chef",
      "comorbidities": "no PMH"
    },
    "presenting_complaint": "Right knee aching for a couple of months, sometimes swells and feels like it catches",
    "socrates": {
      "site": "Right knee (diffuse)",
      "onset": "Gradual, no trauma",
      "character": "Dull ache",
      "radiation": "None",
      "associations": "Intermittent swelling, occasional locking sensation",
      "timing": "On and off",
      "exacerbating": "Long shifts standing, stairs",
      "relieving": "Rest",
      "severity": "5/10"
    },
    "triage_info": {
      "injury_mechanism": "No clear injury",
      "red_flags": "None, but diagnosis unclear",
      "previous_treatment": "Paracetamol",
      "functional_impact": "Work discomfort, but still working"
    },
    "expected_triage": "GP/Primary Care",
    "clinical_notes": "No red flags, but diagnosis uncertain → GP assessment needed",
    "sample_conversation": [
      "My right knee has a dull ache — it’s been a couple of months.",
      "No injury, it just came on.",
      "It’s hard to point to one spot — kind of all over.",
      "It sometimes swells after long shifts.",
      "Now and then it catches, like it wants to lock.",
      "Most days I can move it fully.",
      "No giving way.",
      "I’ve only tried paracetamol.",
      "About 5 out of 10.",
      "No other symptoms.",
      "Should I see my GP for this?",
      "Yes, I’ll book in."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 42-year-old chef presents with a two-month history of right knee pain. The pain began insidiously without trauma. It is diffuse in nature, occasionally associated with swelling, and he describes intermittent episodes where the knee seems to catch or lock briefly. Most of the time he retains full range of movement. Pain is aggravated by prolonged standing during his shifts and by stairs, and is rated five out of ten in severity. He has tried paracetamol with little effect.\n\n    He lives with his partner and two children. He remains at work but finds long days increasingly difficult and struggles with stairs at home. There are no systemic symptoms such as fever, night sweats, or weight loss.\n\n    The diagnosis remains unclear at this stage. Possible differentials include early meniscal pathology, patellofemoral pain, or early degenerative change. Clinical examination is essential to clarify the diagnosis and guide management. At present, there are no red flag features. I would suggest GP review with examination of the knee and consideration of initial referral to physiotherapy. Should true mechanical locking be confirmed, or if symptoms persist, then imaging with plain radiographs or MRI may be warranted.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_9",
    "title": "Hip Pain with Systemic Symptoms",
    "demographics": {
      "age": "55",
      "gender": "female",
      "occupation": "primary school teacher",
      "comorbidities": "PMH: type 2 diabetes"
    },
    "presenting_complaint": "Left hip pain for a month with night sweats, fevers and tiredness",
    "socrates": {
      "site": "Left groin/hip",
      "onset": "Gradual",
      "character": "Deep ache",
      "radiation": "To thigh",
      "associations": "Night sweats, fevers, fatigue",
      "timing": "Constant",
      "exacerbating": "Walking",
      "relieving": "Rest, but still painful",
      "severity": "6/10"
    },
    "triage_info": {
      "injury_mechanism": "Insidious",
      "red_flags": "Fevers, sweats (possible infection or systemic disease)",
      "previous_treatment": "Paracetamol",
      "functional_impact": "Difficulty teaching, fatigued"
    },
    "expected_triage": "GP/Primary Care",
    "clinical_notes": "Red flag systemic symptoms → GP investigation required",
    "sample_conversation": [
      "My left hip’s been sore for about a month.",
      "No injury.",
      "It’s mostly in the groin and sometimes down my thigh.",
      "I’ve had night sweats and feel feverish and worn out.",
      "Rest helps a bit but it still hurts.",
      "I have type 2 diabetes.",
      "No numbness or weakness.",
      "I can walk but it’s painful.",
      "About 6 out of 10.",
      "Do I need A&E?",
      "Not straight away — I’ll see my GP urgently."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 55-year-old primary school teacher, with type 2 diabetes, presents with a one-month history of left groin and hip pain radiating to the thigh. The pain is constant, described as a deep ache, and aggravated by walking. She also reports systemic features including night sweats, intermittent fevers, and significant fatigue. She denies trauma. There has been no erythema, warmth, or visible swelling.\n\n    She lives with her husband and remains in employment, but finds walking around the classroom increasingly difficult. She is concerned about her reduced stamina and is becoming fatigued with routine teaching duties.\n\n    Given her diabetes and the reported systemic symptoms, septic arthritis, inflammatory arthropathy, or malignancy must be excluded. Examination and urgent investigation are indicated. I would recommend prompt GP review with baseline bloods including FBC, CRP, ESR, and blood cultures if febrile. Plain pelvic and hip radiographs would be a reasonable first step, with referral to orthopaedics or rheumatology depending on the findings. She should be advised to seek urgent review if unable to weight bear or should she develop acute systemic illness.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_10",
    "title": "Unexplained Weight Loss with Shoulder Pain",
    "demographics": {
      "age": "61",
      "gender": "male",
      "occupation": "retired",
      "comorbidities": "PMH: hypertension, smoker"
    },
    "presenting_complaint": "Right shoulder pain for 2 months and I’ve lost about 6 kg; wakes me at night",
    "socrates": {
      "site": "Right shoulder",
      "onset": "Gradual",
      "character": "Dull ache",
      "radiation": "To upper arm",
      "associations": "Weight loss 6 kg in 2 months, night pain",
      "timing": "Constant",
      "exacerbating": "None specific",
      "relieving": "None",
      "severity": "5/10"
    },
    "triage_info": {
      "injury_mechanism": "No trauma",
      "red_flags": "Significant weight loss, night pain",
      "previous_treatment": "None",
      "functional_impact": "Reduced function, worried"
    },
    "expected_triage": "GP/Primary Care",
    "clinical_notes": "Weight loss + night pain + smoking history → GP review essential",
    "sample_conversation": [
      "I’ve had pain in my right shoulder for a couple of months.",
      "No injury.",
      "It spreads into the top of my arm.",
      "It wakes me at night.",
      "I’ve lost about six kilos without trying.",
      "I’ve got high blood pressure.",
      "I smoke around 20 a day.",
      "No cough or fevers.",
      "Pain is about 5 out of 10.",
      "Do I need to see my GP urgently?",
      "Yes — I’ll book an appointment tomorrow."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 61-year-old retired man, a smoker with hypertension, presents with a two-month history of right shoulder pain. The pain is dull, radiates to the upper arm, and is present at night, disturbing his sleep. He has lost six kilograms unintentionally in the last two months. He denies cough, chest pain, or fevers. He has not experienced swelling, redness, or local trauma.\n\n    He lives with his wife, is otherwise independent, but finds carrying shopping bags and overhead activities increasingly difficult. He is concerned about his weight loss.\n\n    The presence of unexplained weight loss and nocturnal pain in a smoker is concerning for sinister pathology, including metastatic or primary malignancy. Differential diagnoses include pulmonary malignancy with referred pain, primary bone tumour, or less commonly local shoulder pathology.\n\n    This patient requires urgent GP review for examination and investigation. I would recommend baseline bloods including FBC, ESR, CRP, and liver function tests, together with a chest radiograph to exclude pulmonary disease. Shoulder imaging may be required if systemic pathology is excluded. He should be counselled to seek urgent medical attention if he experiences systemic deterioration or new neurological features.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_11",
    "title": "Mechanical Low Back Pain",
    "demographics": {
      "age": "36",
      "gender": "male",
      "occupation": "warehouse worker",
      "comorbidities": "no PMH"
    },
    "presenting_complaint": "Low back pain for about 4 weeks after lifting a heavy box at work",
    "socrates": {
      "site": "Lumbar spine, central",
      "onset": "Started after lifting heavy box",
      "character": "Dull ache, sometimes sharp",
      "radiation": "None",
      "associations": "Muscle stiffness",
      "timing": "Worse after long shifts, better at weekends",
      "exacerbating": "Bending, lifting, twisting",
      "relieving": "Rest, hot bath",
      "severity": "6/10"
    },
    "triage_info": {
      "injury_mechanism": "Manual handling strain",
      "red_flags": "None (no neurological, systemic features)",
      "previous_treatment": "OTC ibuprofen",
      "functional_impact": "Struggles with work but still managing"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "No red flags, mechanical onset, no previous physio → refer to physio",
    "sample_conversation": [
      "My back’s been sore for about a month since lifting a heavy box.",
      "It’s in the middle of my lower back.",
      "No pain down the legs.",
      "No bladder or bowel problems.",
      "It flares during long shifts.",
      "Rest and hot baths help.",
      "No pins and needles.",
      "No weight loss or fevers.",
      "About 6 out of 10.",
      "I’ve only taken ibuprofen.",
      "Sounds mechanical — will physio help?",
      "Yes — I’m happy to be referred."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for referring this 36-year-old warehouse operative who has presented with a four-week history of low back pain following a lifting incident at work. He recalls straining his back whilst carrying a heavy box. Since then, he has had a persistent dull ache across the lumbar region with intermittent sharp exacerbations, rated around six out of ten in severity. Pain is worse with bending, twisting, and lifting, particularly during long shifts, and improves with rest and hot baths.\n\n    He denies any neurological symptoms, radicular pain, bladder or bowel disturbance, or systemic red flag features. He has been taking ibuprofen with partial relief.\n\n    He lives alone and is independent in activities of daily living, though he finds housework such as vacuuming increasingly uncomfortable. At work he has been struggling with heavier manual handling and has needed colleagues’ assistance.\n\n    The presentation is consistent with acute mechanical low back pain without red flag features. This man has not previously engaged with physiotherapy and would benefit from referral to MSK physiotherapy for education, postural training, and a core strengthening programme. He should continue with regular activity within comfort. He has been counselled regarding the importance of seeking urgent review should new neurological symptoms develop.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_12",
    "title": "Lateral Epicondylitis (Tennis Elbow)",
    "demographics": {
      "age": "48",
      "gender": "female",
      "occupation": "hairdresser",
      "comorbidities": "otherwise fit"
    },
    "presenting_complaint": "Right elbow pain for about 3 months, sharp when I grip things",
    "socrates": {
      "site": "Lateral right elbow",
      "onset": "Gradual, after busy period at work",
      "character": "Sharp on gripping",
      "radiation": "Into forearm",
      "associations": "Weak grip, occasional night ache",
      "timing": "On and off for 3 months",
      "exacerbating": "Scissors use, lifting kettle",
      "relieving": "Rest, wrist strap",
      "severity": "7/10"
    },
    "triage_info": {
      "injury_mechanism": "Repetitive strain",
      "red_flags": "None",
      "previous_treatment": "Wrist strap, OTC painkillers",
      "functional_impact": "Difficulty working, reduced grip strength"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Gradual onset, clear mechanical pattern, not previously treated conservatively",
    "sample_conversation": [
      "I get pain on the outside of my right elbow.",
      "It started about three months ago during a busy spell at work.",
      "It’s sharp when I grip scissors or lift the kettle.",
      "It goes down into my forearm.",
      "My grip feels weak.",
      "Sometimes it aches at night.",
      "I’ve tried a wrist strap and painkillers.",
      "No swelling or numbness.",
      "Pain is around 7 out of 10.",
      "Can physio help with this?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 48-year-old right-handed hairdresser has presented with a three-month history of pain localised to the lateral aspect of the right elbow. Symptoms developed gradually during a period of increased workload and are described as sharp with gripping activities such as using scissors or lifting kettles. Pain radiates into the proximal forearm and is associated with weakness in grip. It is rated seven out of ten and occasionally disturbs sleep.\n\n    She has no history of trauma. There is no swelling, erythema, or paraesthesia. She has trialled a wrist strap and simple analgesia with limited relief.\n\n    She lives with her partner, remains at work, but has reduced her working hours because pain makes prolonged hairdressing tasks unsustainable. This is causing financial strain and concern about her long-term employment.\n\n    The clinical history is strongly suggestive of lateral epicondylitis. I have recommended referral to physiotherapy for eccentric wrist extensor strengthening, soft tissue management, and ergonomic advice to support her occupational demands. She should continue with simple analgesia and pacing in the meantime. If symptoms persist despite therapy beyond six months, further intervention may be considered.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_13",
    "title": "Plantar Fasciitis",
    "demographics": {
      "age": "41",
      "gender": "male",
      "occupation": "secondary school PE teacher",
      "comorbidities": "overweight (BMI 31)"
    },
    "presenting_complaint": "Right heel pain for 4 months — worst with first steps in the morning",
    "socrates": {
      "site": "Right heel, plantar aspect",
      "onset": "Gradual, no trauma",
      "character": "Stabbing pain first steps in morning",
      "radiation": "None",
      "associations": "Limping after PE sessions",
      "timing": "Worst in morning and after activity",
      "exacerbating": "Long walks, running",
      "relieving": "Rest, supportive trainers",
      "severity": "7/10"
    },
    "triage_info": {
      "injury_mechanism": "Overuse, weight-related",
      "red_flags": "None",
      "previous_treatment": "None formal",
      "functional_impact": "Struggles to teach PE, altered gait"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Typical presentation, no red flags, no prior physio → physiotherapy appropriate",
    "sample_conversation": [
      "My right heel’s been sore for months.",
      "It’s on the bottom of the heel.",
      "It’s worst with my first few steps in the morning.",
      "It flares after PE lessons or long walks.",
      "No swelling or redness.",
      "Running makes it worse.",
      "I’ve just been wearing supportive trainers.",
      "Pain is about 7 out of 10.",
      "No other medical issues apart from being a bit overweight.",
      "Can physio help?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for asking me to review this 41-year-old secondary school PE teacher with a four-month history of right heel pain. He describes stabbing pain localised to the plantar aspect of the heel, worst with his first steps in the morning and after long periods on his feet. The pain is aggravated by prolonged walking and running during PE sessions, and improves with rest. He rates pain as seven out of ten.\n\n    There is no trauma, swelling, or systemic illness. He has self-managed with supportive trainers but has not accessed formal therapy. His BMI is 31, which may be contributing.\n\n    He lives with his wife and children. Functionally, he continues teaching but avoids demonstrating running activities to pupils and limits family walks due to pain.\n\n    The presentation is typical of plantar fasciitis. Physiotherapy referral is appropriate to provide stretching and strengthening exercises, load management, and education on footwear and pacing. He should also receive advice regarding weight optimisation. He understands that symptoms can be protracted and has been reassured about the benign nature of the condition.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_14",
    "title": "Shoulder Impingement Syndrome",
    "demographics": {
      "age": "45",
      "gender": "female",
      "occupation": "primary school teacher",
      "comorbidities": "PMH: asthma"
    },
    "presenting_complaint": "Right shoulder pain for about 5 months, worse reaching overhead or lying on it",
    "socrates": {
      "site": "Anterolateral right shoulder",
      "onset": "Gradual, no trauma",
      "character": "Aching, sharp on overhead movement",
      "radiation": "Into upper arm",
      "associations": "Clicking, disturbed sleep when lying on shoulder",
      "timing": "Intermittent, worse with activity",
      "exacerbating": "Reaching overhead, dressing, washing hair",
      "relieving": "Rest, avoiding overhead activity",
      "severity": "6–7/10"
    },
    "triage_info": {
      "injury_mechanism": "Repetitive use (teaching, lifting)",
      "red_flags": "None",
      "previous_treatment": "Analgesia only",
      "functional_impact": "Struggles with work and daily activities"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Classic impingement presentation, no red flags, first-line management = physiotherapy",
    "sample_conversation": [
      "It’s been bothering me for about five months.",
      "No injury — it built up gradually.",
      "It’s at the front and side of my right shoulder.",
      "It spreads into my upper arm.",
      "Reaching up, washing my hair and getting dressed set it off.",
      "It wakes me if I lie on that side.",
      "It sometimes clicks.",
      "No numbness or tingling.",
      "Pain is around 6 to 7 out of 10.",
      "I’ve only tried ibuprofen.",
      "Would physio help this?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 45-year-old primary school teacher presents with a five-month history of right shoulder pain. She localises pain to the anterolateral shoulder, aggravated by overhead tasks such as reaching for cupboards, washing her hair, and dressing. She notes clicking and grinding with movement and reports disturbed sleep when lying on the affected side. Pain severity is six to seven out of ten.\n\n    She denies systemic or neurological features. She has tried ibuprofen with limited benefit and has not had physiotherapy.\n\n    She lives with her husband and children. She manages her teaching duties but struggles with writing on high boards, lifting resources, and childcare tasks such as carrying her youngest child.\n\n    The history is consistent with subacromial impingement or rotator cuff tendinopathy. Physiotherapy referral is appropriate to address rotator cuff strengthening, scapular control, and postural correction. We discussed activity modification, and she has been advised to avoid aggravating repetitive overhead tasks where possible.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_15",
    "title": "Chronic Mechanical Neck Pain",
    "demographics": {
      "age": "39",
      "gender": "male",
      "occupation": "graphic designer",
      "comorbidities": "PMH: migraine"
    },
    "presenting_complaint": "Neck stiffness and ache for 6 months, worse after long hours at the computer",
    "socrates": {
      "site": "Cervical spine, paraspinal muscles",
      "onset": "Gradual, worse with desk work",
      "character": "Stiff, aching",
      "radiation": "None (occasional tension headaches)",
      "associations": "Reduced neck mobility",
      "timing": "Daily, especially afternoons at work",
      "exacerbating": "Long computer sessions, poor posture",
      "relieving": "Stretching, massage, short walks",
      "severity": "5–6/10"
    },
    "triage_info": {
      "injury_mechanism": "Postural/mechanical",
      "red_flags": "None",
      "previous_treatment": "Occasional massage",
      "functional_impact": "Affects concentration at work, frequent headaches"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Typical posture-related pain, conservative management appropriate",
    "sample_conversation": [
      "My neck’s been stiff and sore for about six months.",
      "It’s across the back of my neck.",
      "Sometimes I get tension headaches with it.",
      "No pain or numbness in my arms.",
      "It builds up by the afternoon at work.",
      "Stretching and short walks help a bit.",
      "No weight loss or fevers.",
      "Pain’s around 5 to 6 out of 10.",
      "I’ve had the odd massage.",
      "Would physio and desk setup changes help?",
      "Yes — happy to try physio."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 39-year-old graphic designer has reported a six-month history of mechanical neck pain and stiffness. Pain is localised to the posterior cervical region, described as an ache, and is occasionally associated with tension headaches. It is aggravated by prolonged desk work and improves with stretching, short walks, and massage. He rates it five to six out of ten in severity.\n\n    He denies paraesthesia, weakness, or systemic features. He has not previously had physiotherapy.\n\n    He lives alone and works long hours at a computer. He has reduced his recreational cycling because of neck stiffness, which he finds frustrating.\n\n    The presentation is typical of chronic mechanical or postural neck pain. Physiotherapy would be valuable for posture correction, cervical mobility, and strengthening. Ergonomic workplace adjustments are also recommended. He has been advised to seek urgent review if he develops neurological symptoms.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_16",
    "title": "Patellofemoral Pain Syndrome",
    "demographics": {
      "age": "26",
      "gender": "female",
      "occupation": "recreational runner",
      "comorbidities": "otherwise well"
    },
    "presenting_complaint": "Pain at the front of both knees for 3 months, worse with stairs, squats and running",
    "socrates": {
      "site": "Front of both knees, worse left",
      "onset": "Gradual, started during marathon training",
      "character": "Dull ache, sometimes sharp",
      "radiation": "Around patella",
      "associations": "Clicking, no swelling",
      "timing": "Worse after running, prolonged sitting",
      "exacerbating": "Stairs, squatting, running",
      "relieving": "Rest, ice",
      "severity": "6/10"
    },
    "triage_info": {
      "injury_mechanism": "Overuse with running",
      "red_flags": "None",
      "previous_treatment": "None",
      "functional_impact": "Unable to continue training"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Overuse injury, no red flags, first-line physiotherapy",
    "sample_conversation": [
      "I’ve got pain at the front of my knees, worse on the left.",
      "It’s been about three months.",
      "It started while I was training for a marathon.",
      "The pain is around my kneecap.",
      "It clicks sometimes but there’s no swelling.",
      "Running, stairs and squats set it off.",
      "Sitting too long also makes it ache.",
      "Rest and ice help a bit.",
      "About 6 out of 10.",
      "I haven’t tried physio yet.",
      "Can I be referred?",
      "Yes, please."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 26-year-old recreational runner presents with a three-month history of anterior knee pain, worse on the left. Pain occurs during stairs, squatting, running, and prolonged sitting. She also describes clicking around the patella but denies swelling, locking, or instability. Pain is rated six out of ten.\n\n    There has been no trauma. She has not accessed physiotherapy to date.\n\n    She lives with a friend and is unable to continue her marathon training. She also reports difficulty with climbing stairs at work, which is affecting her daily routine.\n\n    This history is consistent with patellofemoral pain syndrome. Physiotherapy referral is appropriate, with a programme focusing on quadriceps and hip strengthening, gait retraining, and load management. She has been counselled on gradual reintroduction of training and advised to modify activities in the meantime.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_17",
    "title": "Rotator Cuff Tendinopathy",
    "demographics": {
      "age": "58",
      "gender": "male",
      "occupation": "painter/decorator",
      "comorbidities": "PMH: hypertension"
    },
    "presenting_complaint": "Left shoulder aching for 8 months, worse with overhead painting and lifting",
    "socrates": {
      "site": "Lateral left shoulder",
      "onset": "Gradual, related to overhead painting",
      "character": "Aching, sharp with lifting",
      "radiation": "Down lateral arm",
      "associations": "Weakness, painful arc",
      "timing": "Daily, worse evenings",
      "exacerbating": "Overhead activity, lifting",
      "relieving": "Rest, NSAIDs",
      "severity": "7/10"
    },
    "triage_info": {
      "injury_mechanism": "Occupational overuse",
      "red_flags": "None",
      "previous_treatment": "Simple analgesia only",
      "functional_impact": "Struggles to work overhead, limited function"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Occupational overuse, classic mechanical features, no prior physio",
    "sample_conversation": [
      "It’s been painful for about eight months, worse when I’m painting overhead.",
      "It’s on the outside of my shoulder.",
      "It runs down the side of my arm.",
      "Lifting things can be sharp and I feel weaker.",
      "It sometimes wakes me at night.",
      "No numbness.",
      "About 7 out of 10.",
      "I’ve only used painkillers so far.",
      "Will physio help me get back to overhead work?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 58-year-old painter-decorator presents with an eight-month history of left shoulder pain. The pain is lateral, aching, and radiates down the arm. It is aggravated by overhead activity and lifting, and he reports weakness and a painful arc. Pain is often present at night and disturbs sleep. He rates it seven out of ten.\n\n    He has taken analgesia but not had physiotherapy. He has hypertension but is otherwise well.\n\n    He lives with his wife and continues working, though is increasingly limited in his ability to complete overhead tasks. He fears losing work if symptoms persist.\n\n    This presentation is consistent with rotator cuff tendinopathy. Referral to physiotherapy is recommended to address rotator cuff strengthening, scapular stability, and workplace adaptations. If symptoms persist after three to six months, surgical referral could be considered.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_18",
    "title": "Ankle Sprain",
    "demographics": {
      "age": "29",
      "gender": "female",
      "occupation": "retail assistant",
      "comorbidities": "otherwise healthy"
    },
    "presenting_complaint": "Left ankle pain and swelling after twisting it off a kerb 2 weeks ago",
    "socrates": {
      "site": "Lateral left ankle",
      "onset": "Twisted ankle stepping off kerb",
      "character": "Sharp initially, now aching",
      "radiation": "None",
      "associations": "Swelling, bruising initially",
      "timing": "Gradually improving over 2 weeks",
      "exacerbating": "Walking, stairs",
      "relieving": "Ice, elevation",
      "severity": "5/10"
    },
    "triage_info": {
      "injury_mechanism": "Inversion injury",
      "red_flags": "None (no inability to weight bear >24h, no bony tenderness)",
      "previous_treatment": "Rest, ice, bandage",
      "functional_impact": "Limping at work"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Clear sprain, Ottawa ankle rules negative, no red flags → physio appropriate",
    "sample_conversation": [
      "I twisted my ankle stepping off a kerb two weeks ago.",
      "I can walk but I’m limping.",
      "It was swollen and bruised at first.",
      "Now it’s an ache, about 5 out of 10.",
      "No numbness or pins and needles.",
      "Stairs and long walks set it off.",
      "I’ve been resting it with ice and elevating it.",
      "No previous ankle problems.",
      "I haven’t seen physio yet.",
      "Could physio help me recover?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 29-year-old retail assistant sustained a left ankle inversion injury two weeks ago after stepping off a kerb. She was able to weight bear immediately but limped. She developed swelling and bruising, which have improved, but still experiences pain and stiffness. Pain is around five out of ten and worsens with prolonged standing and stairs.\n\n    She has no numbness, bony tenderness, or systemic features. She has used rest, ice, and a bandage. She has not had physiotherapy.\n\n    She lives with her partner and continues to work with modified duties, but struggles with prolonged standing.\n\n    The history is consistent with a lateral ankle sprain. Referral to physiotherapy is appropriate to address proprioceptive rehabilitation, strengthening, and safe graded return to activity. She has been advised to wear supportive footwear and to re-present if pain or instability persists beyond six weeks.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_19",
    "title": "Mechanical Low Back Pain with Recurrent Episodes",
    "demographics": {
      "age": "52",
      "gender": "male",
      "occupation": "taxi driver",
      "comorbidities": "PMH: hypertension"
    },
    "presenting_complaint": "On–off low back pain for 5 years, worse the last 2 months from long hours sitting",
    "socrates": {
      "site": "Central lumbar spine",
      "onset": "Recurrent flare-ups, worsened recently",
      "character": "Aching, stiff",
      "radiation": "None",
      "associations": "Reduced flexibility",
      "timing": "Worse after long driving shifts",
      "exacerbating": "Sitting long periods",
      "relieving": "Short walks, stretching",
      "severity": "6–7/10"
    },
    "triage_info": {
      "injury_mechanism": "Occupational posture strain",
      "red_flags": "None",
      "previous_treatment": "Occasional painkillers, no formal physiotherapy",
      "functional_impact": "Difficulty driving long shifts"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Chronic mechanical symptoms, no red flags, no prior physio → physiotherapy",
    "sample_conversation": [
      "I’ve had back pain on and off for about five years.",
      "It’s got worse over the last couple of months.",
      "It’s in the centre of my lower back.",
      "No pain down the legs.",
      "Long hours sitting in the taxi makes it worse.",
      "Short walks and stretching help.",
      "Pain is 6 to 7 out of 10.",
      "I haven’t done physio before.",
      "Can I be referred to physio?",
      "Yes — please."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 52-year-old taxi driver presents with a five-year history of recurrent low back pain, which has worsened over the last two months. Pain is localised centrally, aching in character, and is aggravated by long periods of sitting during driving shifts. He finds some relief with stretching and walking. Pain is rated six to seven out of ten.\n\n    He denies neurological or systemic features. He has used occasional analgesia but has never had physiotherapy.\n\n    He lives with his wife and two children. The pain is significantly limiting his ability to work long shifts, with increasing financial and occupational impact.\n\n    This is consistent with recurrent mechanical low back pain. Referral to physiotherapy is recommended for core strengthening, posture training, and flare-up management. He has been encouraged to take regular breaks from sitting during shifts. He understands the need for urgent reassessment should new neurological symptoms occur.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_20",
    "title": "Iliotibial Band Syndrome",
    "demographics": {
      "age": "34",
      "gender": "female",
      "occupation": "amateur triathlete",
      "comorbidities": "otherwise well"
    },
    "presenting_complaint": "Pain on the outside of my left knee for 6 weeks, worse on long runs and cycling hills",
    "socrates": {
      "site": "Outer left knee",
      "onset": "Gradual, during triathlon training",
      "character": "Sharp ache",
      "radiation": "Up thigh occasionally",
      "associations": "Clicking with running",
      "timing": "Worse during/after long runs, cycling",
      "exacerbating": "Running >5km, cycling hills",
      "relieving": "Rest, foam rolling",
      "severity": "6/10"
    },
    "triage_info": {
      "injury_mechanism": "Overuse injury",
      "red_flags": "None",
      "previous_treatment": "Self-management with stretching",
      "functional_impact": "Training curtailed, frustration"
    },
    "expected_triage": "MSK Physiotherapy",
    "clinical_notes": "Typical overuse presentation, no red flags, first-line physiotherapy",
    "sample_conversation": [
      "I’ve had pain on the outside of my left knee for six weeks.",
      "It started when I upped my training.",
      "Running beyond about 5k or cycling hills brings it on.",
      "Sometimes it clicks.",
      "No swelling or giving way.",
      "Rest and foam rolling help a bit.",
      "Pain is about 6 out of 10.",
      "I haven’t tried physio yet.",
      "Could I be referred?",
      "Yes, please."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 34-year-old amateur triathlete presents with a six-week history of lateral left knee pain. Pain developed gradually during training, is sharp in nature, and occurs after running beyond five kilometres or cycling hills. She describes occasional clicking but denies swelling, locking, or instability. Pain is rated six out of ten.\n\n    She has not trialled physiotherapy.\n\n    She works in marketing and trains five to six times per week. She has been forced to stop running due to pain, which has caused considerable frustration.\n\n    The clinical picture is consistent with iliotibial band syndrome. Referral to physiotherapy is recommended for biomechanical assessment, hip and gluteal strengthening, and stretching. She will be advised on graded return to training. She has been reassured that the condition is benign but may be protracted if untreated.\n\n    Yours sincerely,\n    Virtual Triage Team"
  },
  {
    "case_id": "case_21",
    "title": "Severe Knee Osteoarthritis, Failed Physio",
    "demographics": {
      "age": "67",
      "gender": "female",
      "occupation": "retired shop assistant",
      "comorbidities": "PMH: hypertension, obesity (BMI 33)"
    },
    "presenting_complaint": "Right knee pain for years, now severe; grinds, swells and sometimes gives way",
    "socrates": {
      "site": "Medial right knee",
      "onset": "Gradual, progressive",
      "character": "Aching, grinding, occasional sharp catches",
      "radiation": "To thigh and shin",
      "associations": "Crepitus, swelling, giving way",
      "timing": "Daily, worse with activity",
      "exacerbating": "Stairs, long walks, standing",
      "relieving": "Rest, occasional ice",
      "severity": "8/10"
    },
    "triage_info": {
      "injury_mechanism": "Degenerative",
      "red_flags": "None",
      "previous_treatment": "Physiotherapy x2 courses, steroid injections, analgesia, weight loss advice",
      "functional_impact": "Cannot walk more than 10 minutes, stairs very difficult"
    },
    "expected_triage": "SWLEOC Orthopaedic Surgery",
    "clinical_notes": "Severe pain + functional loss + failed conservative care → surgery",
    "sample_conversation": [
      "It’s been bad for years and much worse this past year.",
      "The pain’s on the inside of my right knee.",
      "Stairs, standing and longer walks make it awful.",
      "It swells and grinds, and sometimes gives way.",
      "It keeps me awake at night.",
      "Pain is about 8 out of 10.",
      "I’ve done physio twice, had steroid injections and take painkillers.",
      "It only helped a little and not for long.",
      "I can only walk about ten minutes.",
      "I’ve got high blood pressure.",
      "Do I need to see a surgeon now?",
      "Yes — I’d like a referral."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for asking me to review this 67-year-old retired shop assistant who has presented with long-standing right knee pain. She describes an eight-year history of gradually progressive symptoms, which have now become severe and disabling. The pain is focused on the medial aspect of the right knee, described as a deep ache with occasional sharp catching pains, and is frequently associated with swelling and crepitus. She reports regular episodes where the knee feels unstable and gives way, and she finds stairs and prolonged standing particularly difficult. Pain is often present at night and regularly disturbs her sleep.\n\n    She has been appropriately managed conservatively over the years. She has completed two courses of structured physiotherapy and has received intra-articular steroid injections. She uses regular analgesia and has attempted weight loss, but despite these measures her pain has escalated. At present, she is only able to walk for approximately ten minutes at a time before pain forces her to stop, and her activities of daily living are significantly restricted.\n\n    On examination in clinic she walked with an antalgic gait and was using a stick for support. There was a fixed flexion deformity of approximately five degrees, range of movement was from 0 to 90 degrees, and there was marked medial joint line tenderness with obvious crepitus. Neurovascular examination was unremarkable. Radiographs of the right knee confirm advanced tricompartmental osteoarthritis with complete loss of joint space and osteophyte formation.\n\n    Given the severity of her pain, the degree of functional limitation, and the failure of conservative measures, she is an appropriate candidate for surgical intervention. We have discussed total knee arthroplasty in detail, including the risks and expected outcomes. She is motivated to proceed and understands the likely need for postoperative rehabilitation. She will now be optimised pre-operatively, with anaesthetic review and routine pre-assessment arranged.\n\n    Yours sincerely,\n    Consultant Orthopaedic Surgeon"
  },
  {
    "case_id": "case_22",
    "title": "End-Stage Hip Osteoarthritis",
    "demographics": {
      "age": "72",
      "gender": "male",
      "occupation": "retired builder",
      "comorbidities": "PMH: type 2 diabetes"
    },
    "presenting_complaint": "Left hip pain and stiffness for 5 years, now severe; I limp and need a stick",
    "socrates": {
      "site": "Left groin and buttock",
      "onset": "Gradual, progressive",
      "character": "Stiff, grinding pain",
      "radiation": "To thigh and knee",
      "associations": "Limp, reduced mobility",
      "timing": "Daily, worse with activity",
      "exacerbating": "Walking, standing, twisting",
      "relieving": "Rest, analgesia",
      "severity": "9/10"
    },
    "triage_info": {
      "injury_mechanism": "Degenerative",
      "red_flags": "None",
      "previous_treatment": "Analgesia, physiotherapy, steroid injection",
      "functional_impact": "Needs stick, can't shop or garden"
    },
    "expected_triage": "SWLEOC Orthopaedic Surgery",
    "clinical_notes": "Severe pain + functional loss + failed conservative care → surgery",
    "sample_conversation": [
      "My left hip is agony and very stiff.",
      "It’s been getting worse over about five years.",
      "Pain’s in the groin and buttock, down to my knee.",
      "Walking, twisting and standing make it worse.",
      "I use a stick and limp.",
      "Pain is 9 out of 10.",
      "Painkillers, physio and one injection haven’t helped enough.",
      "I move very slowly and can’t shop or garden.",
      "I have type 2 diabetes.",
      "Can I see orthopaedics about surgery?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\n    Thank you for referring this 72-year-old retired builder with a five-year history of worsening left hip pain. He describes constant stiffness and deep-seated pain in the groin and buttock, radiating to the thigh and occasionally to the knee. The pain is rated as nine out of ten in severity, worsens with weight-bearing and twisting movements, and is associated with a pronounced limp. He is now reliant on a stick for mobility. His functional capacity is severely impaired; he can no longer shop independently, he has given up gardening, and he struggles with basic household activities.\n\n    He has tried appropriate conservative measures including oral analgesia, physiotherapy, and a single intra-articular steroid injection, all of which have failed to provide sustained relief. He has type 2 diabetes, which is managed with oral medication, and is otherwise well.\n\n    Examination revealed a markedly antalgic gait and global restriction of hip movement, particularly flexion and internal rotation. Pain was reproduced at the extremes of movement. Neurovascular assessment of the limb was normal. Pelvic and hip radiographs demonstrate advanced degenerative changes with joint space obliteration, osteophyte formation, and subchondral sclerosis, consistent with end-stage osteoarthritis.\n\n    We discussed the diagnosis and the available treatment options. Given the extent of his pain, disability, and the exhaustion of conservative treatment, he is an appropriate candidate for total hip arthroplasty. We have discussed the risks, benefits, and expected outcomes in detail. He is keen to proceed and understands the rehabilitation required. He will now undergo pre-operative optimisation, including diabetic review and anaesthetic assessment, prior to listing for surgery.\n\n    Yours sincerely,\n    Consultant Orthopaedic Surgeon"
  },
  {
    "case_id": "case_23",
    "title": "Mechanical Locking Knee (Meniscal Tear, Failed Physio)",
    "demographics": {
      "age": "33",
      "gender": "male",
      "occupation": "plumber",
      "comorbidities": "otherwise healthy"
    },
    "presenting_complaint": "Right knee locks and hurts after a twisting injury 9 months ago; physio hasn’t stopped the locking",
    "socrates": {
      "site": "Medial right knee",
      "onset": "Twisting injury at work, worsened since",
      "character": "Sharp pain, locking episodes",
      "radiation": "None",
      "associations": "Intermittent swelling, instability",
      "timing": "Daily, unpredictable locking",
      "exacerbating": "Kneeling, twisting",
      "relieving": "Rest, avoiding kneeling",
      "severity": "7/10"
    },
    "triage_info": {
      "injury_mechanism": "Acute twisting injury → likely meniscal tear",
      "red_flags": "None",
      "previous_treatment": "6 months physiotherapy, analgesia, knee support",
      "functional_impact": "Cannot kneel for work, jobs limited"
    },
    "expected_triage": "SWLEOC Orthopaedic Surgery",
    "clinical_notes": "Mechanical locking + failed physio → surgical assessment needed",
    "sample_conversation": [
      "I twisted my knee at work about nine months ago.",
      "The pain’s on the inside of the right knee.",
      "It locks sometimes and I can’t straighten it.",
      "Locking happens a few times a week.",
      "Kneeling and twisting bring it on.",
      "Rest helps, but it keeps coming back.",
      "I did physio for six months — it didn’t stop the locking.",
      "Pain is about 7 out of 10.",
      "No other medical problems.",
      "Can I see a surgeon to sort this?",
      "Yes — I’d like that."
    ],
    "expanded_clinic_letter": "To GP,\n\n    This 33-year-old plumber was seen following a nine-month history of right medial knee pain and recurrent locking episodes. His symptoms began after a twisting injury at work, and since then he has experienced sharp medial pain, intermittent swelling, and frequent mechanical locking during which he is unable to fully extend the knee. These episodes occur several times per week, severely restricting his ability to kneel and squat, which is essential for his occupation. He has persisted with six months of structured physiotherapy, along with bracing and analgesia, but continues to experience significant symptoms with little improvement.\n\n    On examination, he had a mild effusion, medial joint line tenderness, and a positive McMurray’s test. Range of motion was limited to 0–100 degrees, with pain on forced flexion. Ligamentous stability was intact and distal neurovascular status was normal. An MRI scan confirmed a complex medial meniscal tear with early degenerative change but preserved joint space.\n\n    Given the persistence of mechanical symptoms and failure of conservative management, he is an appropriate candidate for arthroscopic intervention. We have discussed arthroscopic meniscal surgery in detail, including risks and realistic expectations regarding outcome. He wishes to proceed, and arrangements are being made for pre-operative assessment and listing.\n\n    Yours sincerely,\n    Consultant Orthopaedic Surgeon"
  },
  {
    "case_id": "case_24",
    "title": "End-Stage Shoulder OA (Failed Conservative Care)",
    "demographics": {
      "age": "60",
      "gender": "female",
      "occupation": "admin worker",
      "comorbidities": "PMH: hypothyroidism"
    },
    "presenting_complaint": "Left shoulder pain and stiffness for 4 years, now severe; crunching and very limited movement",
    "socrates": {
      "site": "Left shoulder, diffuse",
      "onset": "Gradual, progressive",
      "character": "Constant ache, grinding",
      "radiation": "Into upper arm",
      "associations": "Severe stiffness, crepitus, night pain",
      "timing": "Daily, severe restriction",
      "exacerbating": "Any shoulder movement",
      "relieving": "Rest, analgesia",
      "severity": "8–9/10"
    },
    "triage_info": {
      "injury_mechanism": "Degenerative OA",
      "red_flags": "None",
      "previous_treatment": "Analgesia, physiotherapy, steroid injections – failed",
      "functional_impact": "Cannot dress independently, work severely affected"
    },
    "expected_triage": "SWLEOC Orthopaedic Surgery",
    "clinical_notes": "Severe arthritis + failed conservative care → surgical assessment needed",
    "sample_conversation": [
      "It’s been four years and getting worse.",
      "Pain is all around my left shoulder and down my arm.",
      "Any movement sets it off.",
      "It’s very stiff — hardly moves.",
      "It grinds and crunches a lot.",
      "It keeps me awake at night.",
      "Pain is about 9 out of 10.",
      "I’ve tried physio, injections and painkillers — not much help.",
      "I struggle to dress myself and can’t manage overhead tasks.",
      "Can I see orthopaedics about surgery?",
      "Yes — please refer me."
    ],
    "expanded_clinic_letter": "To GP,\n\nThank you for asking me to review this 60-year-old office administrator with a four-year history of progressive left shoulder pain and stiffness. She describes constant pain rated eight to nine out of ten, radiating down the upper arm, associated with marked grinding and crepitus. Pain is present at rest and frequently disturbs her sleep. She has profound functional limitation and is unable to dress independently or perform overhead activities.\n\nShe has been managed conservatively with multiple courses of physiotherapy, oral analgesia, and two intra-articular steroid injections. These provided only transient benefit. She has hypothyroidism but is otherwise fit and well.\n\nExamination revealed global restriction of shoulder movement, with forward flexion limited to 60 degrees and almost no external rotation. Pain was reproduced throughout the range, and crepitus was palpable. Neurovascular assessment was normal. Radiographs confirmed end-stage glenohumeral osteoarthritis with complete joint space loss, subchondral sclerosis, and osteophyte formation.\n\nWe discussed the nature of the condition and treatment options. Given her persistent severe pain, major functional restriction, and failed conservative management, she is an appropriate candidate for surgical intervention. We have discussed shoulder arthroplasty, including risks, potential complications, and expected outcomes. She is keen to proceed and understands the rehabilitation process required. Pre-operative CT has been requested for implant templating, and she will be seen in pre-assessment clinic prior to listing.\n\nYours sincerely,\nConsultant Orthopaedic Surgeon"
  }
]
